/**
*              **Grupo HttpCats**
 * ================================================
 * | Nome                            | RA         |
 * ================================================
 * | Ana Santos Nascimento           | 3036101499 |
 * | Breno Fessel Da Paz             | 3026104340 |
 * | Gabrielli Minhano Barbosa       | 3026103592 |
 * | Rafael Baptista de Almeida      | 3026103546 |
 * | Rafaella Pinto Hahon            | 3026102787 |
 * | Victor Nunes Garcia             | 3026101023 |
 * ================================================
 *
 * Olá, pro! O nosso programa em C está ligado ao nosso banco de dados!
 */

#include <locale.h>
#include <stdio.h>
#include "bd.h"
#include "categoria_produto.h"
#include "pedido.h"
#include "produto.h"
#include "utilidades.h"

// Para poder rodar os printf em Português corretamente
#ifdef _WIN32
#include <windows.h>
#endif

int main()
{
    setlocale(LC_ALL, "pt_BR.UTF-8");

    // Para poder usar o encoding e o idioma Português no terminal do Windows
#ifdef _WIN32
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);
#endif

    int opcao;

    printf("\n\n");
    printf("                         ::-======+.:*                      \n");
    printf("                    :=======%%==:%%%%=======.+                         ███   ███  ████  █████\n");
    printf("                 .=====-===%%@%%==%%===%%====-===                      █     █   █ █   █ █\n");
    printf("              .===%%====%%%%%%===========%%@=%%==%%===:                   █     █   █ █   █ ████\n");
    printf("            :=====%%==%%====%%%%#######%%%%====%%%%=%%=%%==:                 █     █   █ █   █ █\n");
    printf("           :==%%==%%====%%##-%%#########:*##%%======-%%==                 ███   ███  ████  █████\n");
    printf("          :=%%%%-=%%===####.+==.:...:#-=*#####==:-=%%===.       \n");
    printf("         .=%%===#==%%#####%%:+++*+-++++=*######%%==#%%%%=%%=.      \n");
    printf("        :========#######.++-=++++*.*++.#######==%%=====              ███   ███  █████\n");
    printf("        ==%%==@==%%#######++++.+:.+.++.+=#######%%==*==%%=:            █     █   █   █\n");
    printf("       :=======@########..+..%%%%:%%.:.+-.##.#####*=======            █     █████   █\n");
    printf("       .===+===%%#######=#.=%%%%%%%%%%%%%%%%+=:####.####%%===+===:           █     █   █   █\n");
    printf("       :++%%%%++=%%########.+-=#%%####+=+-:%%*-*%%:##%%=+%%%%%%+=.            ███  █   █   █\n");
    printf("       :+++%%%%+-%%#################.%%+++.#%%#%%#:+:%%=+%%%%=+=:    \n");
    printf("       :=++++++=#:################%%%%*+=%%#.%%##:#=++++++=     \n");
    printf(
        "        =++++++-%%#*#+##.%%##*%%.:###%%%%+*++*+-+.#%%-++++++:             ███   ███  █████ █████ █████ █████ \n");
    printf(
        "        -=++++++-%%.###############:%%++=::.@##%%=+=@%%++:             █     █   █ █     █     █     █    \n");
    printf(
        "         .=++@%%-++=++#############%%: :* +=++=++%%+@++=              █     █   █ ████  ████  ████  ████  \n");
    printf(
        "          +=++#%%%%++=:*++++#.:.-=+##*+:=+++=-+++%%%%++.               █     █   █ █     █     █     █  \n");
    printf(
        "            :=++-+*=++==+++++++++===+++==+++=+%%++=:                 ███   ███  █     █     █████ █████ \n");
    printf("              .=++#++=%%+++=====+=-===+++%%%%@%%=++=:           \n");
    printf("                :=++++++++%%%%%%+=-+@%%%%+++%%-++++=:             \n");
    printf("                   :==++++++@=%%+=+*++++++=+:                \n");
    printf("                       .:+==-+++++===+:-                    \n");
    printf("\n\n");

    bd_conectar();

    // TODO: login de funcionario?

    do
    {
        printf("\n\n");
        printf("        ▓   ▓ ▓▓▓▓▓ ▓   ▓ ▓   ▓    ▓▓▓▓  ▓▓▓▓  ▓▓▓ ▓   ▓  ▓▓▓  ▓▓▓ ▓▓▓▓   ▓▓▓  ▓\n");
        printf("        ▓▓ ▓▓ ▓     ▓▓  ▓ ▓   ▓    ▓   ▓ ▓   ▓  ▓  ▓▓  ▓ ▓      ▓  ▓   ▓ ▓   ▓ ▓\n");
        printf("        ▓ ▓ ▓ ▓▓▓▓  ▓ ▓ ▓ ▓   ▓    ▓▓▓▓  ▓▓▓▓   ▓  ▓ ▓ ▓ ▓      ▓  ▓▓▓▓  ▓▓▓▓▓ ▓\n");
        printf("        ▓   ▓ ▓     ▓  ▓▓ ▓   ▓    ▓     ▓  ▓   ▓  ▓  ▓▓ ▓      ▓  ▓     ▓   ▓ ▓\n");
        printf("        ▓   ▓ ▓▓▓▓▓ ▓   ▓  ▓▓▓     ▓     ▓   ▓ ▓▓▓ ▓   ▓  ▓▓▓  ▓▓▓ ▓     ▓   ▓ ▓▓▓▓▓\n");
        printf("\n");
        printf("1 - Cadastrar produto\n");
        printf("2 - Cadastrar pedidos\n");
        printf("3 - Listar pedidos\n");
        printf("4 - Sair\n");
        printf("Escolha: ");
        opcao = entrada_int();

        // TODO: cadastrar clientes
        // TODO: cadastrar funcionarios

        switch (opcao)
        {
        case 1:
            produto_cadastrar();
            break;

        case 2:
            pedido_criar();
            break;

        case 3:
            pedido_listar();
            break;

        case 4:
            printf("Tchau tchau!\n");
            break;

        default:
            printf("Opção inválida.\n");
        }
    }
    while (opcao != 4);

    bd_limpa_fecha();

    return 0;
}
